YCSB Outputs/Workload B/runb4
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/swan/YCSB/mongodb/conf:/home/swan/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/swan/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/swan/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/swan/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/swan/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloadb -p operationcount=400000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
Command line: -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloadb -p operationcount=400000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2020-04-24 06:51:03:400 0 sec: 0 operations; est completion in 0 second 
Apr 24, 2020 6:51:03 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/yscb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:282}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=STANDALONE, state=CONNECTED, ok=true, version=ServerVersion{versionList=[4, 2, 6]}, minWireVersion=0, maxWireVersion=8, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=6462443}
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:284}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:292}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:286}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:283}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:285}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:295}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:296}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:287}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:288}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:297}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:293}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:294}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:291}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:290}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:289}] to localhost:27017
Apr 24, 2020 6:51:04 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:298}] to localhost:27017
2020-04-24 06:51:13:321 10 sec: 91953 operations; 9194.38 current ops/sec; est completion in 34 seconds [READ: Count=87356, Max=375039, Min=172, Avg=1578.33, 90=2621, 99=7951, 99.9=23087, 99.99=331007] [UPDATE: Count=4667, Max=44255, Min=239, Avg=1749.14, 90=3197, 99=8155, 99.9=22271, 99.99=44255] 
2020-04-24 06:51:23:321 20 sec: 242318 operations; 15036.5 current ops/sec; est completion in 14 seconds [READ: Count=142899, Max=92031, Min=141, Avg=1051.92, 90=1737, 99=4283, 99.9=11751, 99.99=25887] [UPDATE: Count=7425, Max=25711, Min=218, Avg=1193.25, 90=1987, 99=4551, 99.9=12039, 99.99=24463] 
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:292}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:293}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:298}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:284}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:288}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:289}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:297}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:290}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:295}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:287}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:286}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:291}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:285}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:283}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:294}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:51:32 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:296}] to localhost:27017 because the pool has been closed.
2020-04-24 06:51:32:795 29 sec: 400000 operations; 16643.66 current ops/sec; [READ: Count=149777, Max=58207, Min=125, Avg=926.27, 90=1628, 99=3919, 99.9=10839, 99.99=22671] [CLEANUP: Count=16, Max=25727, Min=1, Avg=1609.44, 90=2, 99=25727, 99.9=25727, 99.99=25727] [UPDATE: Count=7876, Max=26335, Min=194, Avg=1117.15, 90=2033, 99=4407, 99.9=10807, 99.99=23487] 
[OVERALL], RunTime(ms), 29475
[OVERALL], Throughput(ops/sec), 13570.822731128075
[TOTAL_GCS_G1_Young_Generation], Count, 239
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 352
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1942324003392706
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 239
[TOTAL_GC_TIME], Time(ms), 352
[TOTAL_GC_TIME_%], Time(%), 1.1942324003392706
[READ], Operations, 380032
[READ], AverageLatency(us), 1123.4016924890536
[READ], MinLatency(us), 125
[READ], MaxLatency(us), 375039
[READ], 95thPercentileLatency(us), 2519
[READ], 99thPercentileLatency(us), 5315
[READ], Return=OK, 380032
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 1609.4375
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 25727
[CLEANUP], 95thPercentileLatency(us), 11
[CLEANUP], 99thPercentileLatency(us), 25727
[UPDATE], Operations, 19968
[UPDATE], AverageLatency(us), 1293.156750801282
[UPDATE], MinLatency(us), 194
[UPDATE], MaxLatency(us), 44255
[UPDATE], 95thPercentileLatency(us), 3065
[UPDATE], 99thPercentileLatency(us), 5775
[UPDATE], Return=OK, 19968